"""Двумерный список используется как двумерный массив или таблица"""
line = [1, 7, 6, 11, 3]
# На примере кодирования изображения получаем:
img = [[1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3]]
# или
img2 = [line] * 5
"""Обращение к эелементам во вложенном списке"""
print(img[0][1])  # 7
img[1] = [0, 0, 0, 0, 0]  # Записываем новые значения
print(img)  # [[1, 7, 6, 11, 3], [0, 0, 0, 0, 0], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3]]
img[1][:] = [1] * 5  # Формируем новый список
print(img)  # [[1, 7, 6, 11, 3], [1, 1, 1, 1, 1], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3], [1, 7, 6, 11, 3]]
