"""Сформировать список из квадратов целых чисел"""
# 1 способ
N = 6
a = [0] * N  # начальный список из нулей, длиной N

for i in range(N):
    a[i] = i ** 2

print(a)  # [0, 1, 4, 9, 16, 25]

# 2 способ (генератор списков)

b = [x ** 2 for x in range(N)]
print(b)  # [0, 1, 4, 9, 16, 25]

"""Другие примеры"""
c = [1 for x in range(5)]  # x - временная переменная
print(c)  # [1, 1, 1, 1, 1]

d = [x % 4 for x in range(5)]  # остатки от деления на 4
print(d)  # [0, 1, 2, 3, 0]

e = [x % 2 == 0 for x in range(5)]  # четное или нечетное значение
print(e)  # [True, False, True, False, True]

f = [0.5 * x + 1 for x in range(5)]  # Линейная функция
print(f)  # [1.0, 1.5, 2.0, 2.5, 3.0]

g = [x for x in 'python']
print(g)  # ['p', 'y', 't', 'h', 'o', 'n']

"""Примеры с условиями"""
h = [x for x in range(-5, 5) if x < 0]  # Список в диапазоне от -5 до 5, если отрицательное значение
print(h)  # [-5, -4, -3, -2, -1]

k = [x for x in range(-10, 10) if x % 2 == 0]  # только четные значения
print(k)  # [-10, -8, -6, -4, -2, 0, 2, 4, 6, 8]

m = [x for x in range(-20, 20) if x % 2 == 0 and x % 3 == 0]  # четные значения и кратные 3
print(m)  # [-18, -12, -6, 0, 6, 12, 18]

cities = ['Москва', 'Тверь', 'Рязань', 'Ярославль', 'Владимир']
n = [x for x in cities if len(x) < 7]  # Города, длина которых меньше 7 (букв)
print(n)  # ['Москва', 'Тверь', 'Рязань']

"""Тернарный (условный) оператор внутри генераторов списков"""

o = [4, 3, -5, 0, 2, 11, 122, -8, 9]
p = ['Четное' if x % 2 == 0 else 'Нечетное' for x in o]  # Четное или Нечетное число в списке
print(p)  # ['Четное', 'Нечетное', 'Нечетное', 'Четное', 'Четное', 'Нечетное', 'Четное', 'Четное', 'Нечетное']
