a = [(i, j) for i in range(3) for j in range(4)]
print(a)  # [(0, 0), (0, 1), (0, 2), (0, 3), (1, 0), (1, 1), (1, 2), (1, 3), (2, 0), (2, 1), (2, 2), (2, 3)]
"""Аналогично, но с условиями"""
b = [(i, j)
     for i in range(3) if i % 3 == 0
     for j in range(4) if j % 2 == 0
     ]
print(b)  # [(0, 0), (0, 2)]

"""Таблица умножения"""
c = [f'{i}*{j}={i * j}'
     for i in range(3)
     for j in range(4)
     ]
print(c)  # ['0*0=0', '0*1=0', '0*2=0', '0*3=0', '1*0=0', '1*1=1', '1*2=2', '1*3=3', '2*0=0', '2*1=2', '2*2=4', '2*3=6']

"""Двумерный список в одномерный"""
matrix = [[0, 1, 2, 3],
          [10, 11, 12, 13],
          [20, 21, 22, 23]
          ]
d = [x
     for row in matrix
     for x in row
     ]
print(d)  # [0, 1, 2, 3, 10, 11, 12, 13, 20, 21, 22, 23]
d2 = [x
      for x in matrix
      ]
print(d2)
"""Вложенные генераторы списков"""
M, N = 3, 4
matrix2 = [[a for a in range(M)] for b in range(N)]
print(matrix2)  # [[0, 1, 2], [0, 1, 2], [0, 1, 2], [0, 1, 2]]

"""Работа со всем элементами вложенного списка лучше с помощью вложенного генератора списков"""
A = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
e = [[x ** 2 for x in row] for row in A]  # двумерный список, элементы в квадрате
print(e)  # [[1, 4, 9], [16, 25, 36], [49, 64, 81]]
f = [x ** 2 for row in A for x in row]  # одномерный список, элементы в квадрате
print(f)  # [1, 4, 9, 16, 25, 36, 49, 64, 81]
