import math

"""Модуль числа"""
print(abs(-5))  # 5
"""Минимальное и максимальное значение"""
print(min(2, 4, 7))  # 2
print(max(-2, 4, 9))  # 9
"""Возведение в степень"""
print(pow(6, 2))  # 36
"""Округление значений"""
print(round(0.5))  # 0
print(round(1.5))  # 2
print(round(10.5))  # 10 (особенность)
print(round(7.8598, 2))  # 7.86 (округление до сотых из-за аргумента 2)
print(round(7.759, -1))  # 10 (округление до десятка)
print(round(787.759, -2))  # 800 (округление до сотен)

"""math"""
"""Округление до наибольшего целого"""
print(math.ceil(5.2))  # 6
"""Округление до наименьшего целого"""
print(math.floor(5.99))  # 5
"""Факториал"""
print(math.factorial(6))  # 720
"""Отбрасывание дробной части"""
print(math.trunc(5.88))  # 5 (аналог int)
"""Логарифмы"""
print(math.log(8, 2))  # 3
"""Квадратный корень"""
print(math.sqrt(16))  # 4
