def id_odd(x):
    "функция определяет, четное ли значение"
    return x % 2


a = [4, 3, -10, 1, 7, 12]
b = sorted(a, key=id_odd)  # ссылка на функцию
a.sort(key=lambda x: x % 2)
print(b)  # [4, -10, 12, 3, 1, 7]
print(a)  # [4, -10, 12, 3, 1, 7]

lst = ['Москва', 'Тверь', 'Смоленск', 'Псков', 'Рязань']

b = sorted(lst, key=len)  # сортировка списка по длине
print(b)  # ['Тверь', 'Псков', 'Москва', 'Рязань', 'Смоленск']

c = sorted(lst, key=lambda x: x[-1])  # сортировка по последнему символу
print(c)  # ['Москва', 'Псков', 'Смоленск', 'Тверь', 'Рязань'] (а, в,к, ь, ь)

"""Сортировка кортежа. Список книг по возорастанию цены"""
books = (('Пушкин', 200), ('Тургенев', 250), ('Булгаков', 500), ('Гоголь', 190))

d = sorted(books, key=lambda x: x[-1])
print(d)  # [('Гоголь', 190), ('Пушкин', 200), ('Тургенев', 250), ('Булгаков', 500)]
